{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-NAME",
    "2": "I-NAME",
    "3": "B-SKILL",
    "4": "I-SKILL",
    "5": "B-EMAIL",
    "6": "I-EMAIL",
    "7": "B-PHONE",
    "8": "I-PHONE",
    "9": "B-EDU",
    "10": "I-EDU",
    "11": "B-EXP",
    "12": "I-EXP",
    "13": "B-EXP-DATE",
    "14": "I-EXP-DATE",
    "15": "B-EDU-DATE",
    "16": "I-EDU-DATE"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-EDU": 9,
    "B-EDU-DATE": 15,
    "B-EMAIL": 5,
    "B-EXP": 11,
    "B-EXP-DATE": 13,
    "B-NAME": 1,
    "B-PHONE": 7,
    "B-SKILL": 3,
    "I-EDU": 10,
    "I-EDU-DATE": 16,
    "I-EMAIL": 6,
    "I-EXP": 12,
    "I-EXP-DATE": 14,
    "I-NAME": 2,
    "I-PHONE": 8,
    "I-SKILL": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "visual_embed": true,
  "vocab_size": 50265
}
